api-definitions/openapi/examples/ReqVerificaBollettino.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
  <soapenv:Header />
  <soapenv:Body>
    <nod:verificaBollettinoReq>
      <idPSP>POSTE3</idPSP>
      <idBrokerPSP>BANCOPOSTA</idBrokerPSP>
      <idChannel>POSTE3</idChannel>
      <password>${password}</password>
      <ccPost>${#TestCase#codicePA}</ccPost>
      <noticeNumber>311${#TestCase#iuv15}</noticeNumber>
    </nod:verificaBollettinoReq>
  </soapenv:Body>
</soapenv:Envelope>